{
  "backend/main.mo": "Main actor implementing a bike marketplace with user profiles, bike listings, messaging, and founder admin functionality using authorization and blob storage mixins.",
  "backend/migration.mo": "Migration module that transforms old actor state to new actor state by adding founder-related fields (founderEmail, founderPrincipal, founderProfile) while preserving existing user profiles, bike listings, and messages.",
  "feature_evidence.json": "Feature evidence report documenting implementation of PWA conversion, About Us/Founder page, Admin Panel, and founder profile editor with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and utilities for the bike marketplace application.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark theme variables for the marketplace design system.",
  "frontend/index.html": "HTML entry point with PWA manifest link, theme color meta tag, and apple-touch-icon for progressive web app functionality.",
  "frontend/public/manifest.json": "Web app manifest defining PWA metadata including name, icons, theme colors, and standalone display mode for 2nd Bike Bajar Bijapur.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets and network-first for API calls to enable offline functionality.",
  "frontend/src/App.tsx": "Root application component with TanStack Router configuration defining routes for home, listings, sell, messages, about, and admin pages wrapped in Layout and ThemeProvider.",
  "frontend/src/components/AdminListingsManager.tsx": "Admin component for managing bike listings with a table view, edit and delete actions, confirmation dialogs, and loading states using React Query mutations.",
  "frontend/src/components/BikeCard.tsx": "Displays a single bike listing as a card with image, title, brand/model, price, year, mileage, and condition badge, linking to the detailed listing page.",
  "frontend/src/components/BikeFilters.tsx": "Filter sidebar component for bike listings with price range, year range, condition dropdown, and brand text input, plus a clear filters button.",
  "frontend/src/components/EditListingDialog.tsx": "Modal dialog with a form for editing existing bike listings, using react-hook-form for validation and React Query mutation for updates.",
  "frontend/src/components/Footer.tsx": "Site footer with branding, quick navigation links, contact info, and copyright notice including a Caffeine.ai attribution link.",
  "frontend/src/components/FounderProfileEditor.tsx": "Component for viewing and editing founder profile information (name, address, contact, email, Instagram) with toggle between view and edit modes.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with logo, desktop/mobile menus, conditional links based on authentication and founder status, and login button integration.",
  "frontend/src/components/Hero.tsx": "Hero section component with background image, gradient overlay, and call-to-action buttons for browsing bikes and selling bikes.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that renders Header, Footer, ProfileSetup dialog, and page content in a flex column structure.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/MessageInput.tsx": "Message composition component with textarea and send button, supporting Enter-to-send and Shift+Enter for new lines.",
  "frontend/src/components/MessageThread.tsx": "Scrollable message thread display component that shows messages with sender alignment, timestamps, and auto-scrolls to latest message.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog component that prompts authenticated users without profiles to enter their name and contact information.",
  "frontend/src/components/SearchBar.tsx": "Search input component with debounced onChange handler (300ms) and search icon decoration.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, initializes access control, and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current authenticated user's profile from the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for bike listings CRUD operations (get, create, update, delete) and messaging functionality with automatic cache invalidation.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "React Query mutation hook that saves the current user's profile and invalidates the profile query cache on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for a marketplace theme, including light/dark mode color palettes (teal primary, orange accent) and utility classes for hero gradients and card hover effects.",
  "frontend/src/lib/utils.ts": "Utility functions including `cn` for merging Tailwind classes with clsx and `debounce` for delaying function execution.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AboutUs.tsx": "Displays founder profile information (name, address, contact, email, social links) fetched from backend with loading states and fallback data.",
  "frontend/src/pages/AdminPanel.tsx": "Protected admin page that checks founder authentication and displays founder profile editor and listings manager components with access control.",
  "frontend/src/pages/BikeDetail.tsx": "Displays detailed view of a single bike listing with specs, price, condition badge, and contact options, including owner detection and error handling.",
  "frontend/src/pages/BikeListings.tsx": "Browse page with search bar, filter sidebar (price, year, condition, brand), and grid of bike cards with client-side filtering logic.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section, three feature cards (trusted sellers, easy search, direct contact), and grid of three recent bike listings.",
  "frontend/src/pages/Messages.tsx": "Messages page component that displays a conversation thread between buyer and seller for a specific bike listing, with listing details sidebar and message input functionality requiring authentication.",
  "frontend/src/pages/MyListings.tsx": "My Listings page showing authenticated user's bike listings with options to view, edit, delete, and toggle availability status, requiring authentication to access.",
  "frontend/src/pages/SellBike.tsx": "Sell Bike form page for authenticated users to create new bike listings with fields for title, brand, model, year, price, mileage, condition, description, and contact info.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended animations, custom fonts (Inter and Poppins), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file documenting a second-hand bike marketplace with Internet Identity authentication, founder details (Anuj Saha), PWA implementation, WhatsApp integration, and existing features including listings, search, filters, and messaging."
}