{
  "backend/main.mo": "Main Motoko actor implementing a bike marketplace with founder/admin authentication, user/buyer profiles, bike listings, messaging, and website content management using mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report documenting the requirement to update AboutUs.tsx with founder details (Anuj Kumar, contact 7828226397, location Bijapur Chhattisgarh 494444).",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and utilities for the bike marketplace application.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining design tokens for the marketplace UI.",
  "frontend/index.html": "HTML entry point with PWA manifest, theme color, and root div for React mounting.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons, theme colors, and display settings for 2nd Bike Bajar Bijapur.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets and network-first for API calls with cache management.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes, QueryClient, ThemeProvider, and layout structure including Header, Footer, and ProfileSetup.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard displaying metrics cards (visitors, listings, users, activity), recent activity feed, and analytics chart with loading states.",
  "frontend/src/components/AdminListingsManager.tsx": "Displays a table of all bike listings with edit and delete actions for administrators. Includes confirmation dialogs and integrates with EditListingDialog for editing functionality.",
  "frontend/src/components/AdminLoginSection.tsx": "Renders the admin login page with Internet Identity authentication, featuring a hero image and secure login button. Redirects to admin dashboard upon successful authentication.",
  "frontend/src/components/AdminRoute.tsx": "Protected route wrapper that checks admin authentication status and redirects to login if unauthorized. Shows loading skeleton while checking authentication.",
  "frontend/src/components/AdminSettings.tsx": "Admin settings dashboard containing sections for founder profile editing, buyer management, and all listings management. Organizes multiple admin management components into a unified interface.",
  "frontend/src/components/AnalyticsChart.tsx": "Displays a line chart showing platform usage trends over time including visitors, users, and listings. Uses Recharts library for data visualization.",
  "frontend/src/components/BikeCard.tsx": "Card component displaying bike listing summary with image, title, price, year, mileage, and condition badge. Includes share buttons and links to detailed listing page.",
  "frontend/src/components/BikeFilters.tsx": "Filter panel for bike listings with inputs for price range, year range, condition, and brand. Includes clear filters button when active filters are applied.",
  "frontend/src/components/BuyerProfileForm.tsx": "A multi-step form component for creating buyer profiles with text fields (name, phone, email, address, Aadhaar, PAN) and file uploads (profile photo, Aadhaar doc, PAN doc). Handles validation, file upload progress tracking, and sequential submission through multiple mutation hooks.",
  "frontend/src/components/BuyerRegistrationSection.tsx": "A landing section component that displays buyer registration benefits and a call-to-action button to authenticate via Internet Identity. Shows loading states and triggers toast notifications for authentication success/failure.",
  "frontend/src/components/BuyersManagement.tsx": "An admin table component displaying all buyer profiles with columns for personal details, document numbers, and completion status. Includes a dialog for viewing detailed buyer information and uploaded documents.",
  "frontend/src/components/ContentEditor.tsx": "An admin component for editing website content sections (hero, about page, footer) with inline editing, save/cancel actions, and loading skeletons. Uses mutation hooks to persist changes and displays toast notifications.",
  "frontend/src/components/ContentModeration.tsx": "An admin moderation interface with tabbed views (active/inactive/all) for managing bike listings. Provides actions to toggle availability, delete listings, and view detailed listing information in a dialog.",
  "frontend/src/components/EditListingDialog.tsx": "A dialog component for editing bike listings with a form that includes fields for title, brand, model, year, price, mileage, condition, description, contact info, and availability. Uses react-hook-form for form management and calls useUpdateListing mutation to save changes.",
  "frontend/src/components/Footer.tsx": "Footer component displaying brand logo, quick navigation links, contact information, and copyright notice. Fetches dynamic footer content from backend and includes a caffeine.ai attribution link.",
  "frontend/src/components/FounderProfileEditor.tsx": "Component for viewing and editing founder profile information (name, address, contact, email, Instagram). Displays read-only view by default with an edit mode that uses react-hook-form and calls useUpdateFounderProfile mutation.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, responsive menu, and conditional navigation links based on authentication status (founder/admin). Includes LoginButton component and founder login button.",
  "frontend/src/components/Hero.tsx": "Hero section component with background image, search bar for bike listings, and CTA buttons. Fetches and displays dynamic hero content from backend with fallback to default text.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that combines Header, Footer, ProfileSetup, and ProfileCompletionBanner components with a flex layout for full-height pages.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout using useInternetIdentity hook. Shows loading state during authentication and clears query cache on logout.",
  "frontend/src/components/MessageInput.tsx": "Textarea-based message input component with send button that handles form submission and supports Enter key to send (Shift+Enter for new line).",
  "frontend/src/components/MessageThread.tsx": "Scrollable message thread display component that shows messages with sender alignment (right for current user, left for others) and auto-scrolls to bottom on new messages.",
  "frontend/src/components/ProfileCompletionBanner.tsx": "Displays a warning banner prompting authenticated non-founder users with incomplete buyer profiles to complete their profile for marketplace access.",
  "frontend/src/components/ProfileSetup.tsx": "Manages sequential profile setup modals: first collects basic user profile (name, contact), then prompts for buyer profile completion if needed.",
  "frontend/src/components/ProfileShareButtons.tsx": "Provides social media share buttons (WhatsApp, Facebook, Twitter, Telegram) and copy-to-clipboard functionality for user profiles and seller shop links.",
  "frontend/src/components/SearchBar.tsx": "Renders a debounced search input field with a search icon for filtering bike listings.",
  "frontend/src/components/SellerProfileForm.tsx": "Form component for creating seller profiles with shop name, contact info, and business details validation, navigating to listings page on success.",
  "frontend/src/components/SellerRegistrationSection.tsx": "Landing section promoting seller registration with benefits list and a button that triggers authentication and seller profile form modal.",
  "frontend/src/components/ShareButtons.tsx": "Provides social media share buttons and copy link functionality for individual bike listings in both compact and full variants.",
  "frontend/src/components/UsersManagement.tsx": "React component that displays a searchable table of all buyer profiles with user details, status badges, and a dialog for viewing individual user information.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance with authentication, initializes access control with admin token, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminAuth.ts": "Custom hook that manages admin authentication state with session storage, providing login/logout functions and 24-hour session persistence.",
  "frontend/src/hooks/useBuyerProfile.ts": "Collection of React Query hooks for managing buyer profiles including CRUD operations, document uploads (profile photo, Aadhaar, PAN), and profile completion status.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Custom hook that fetches the current authenticated user's profile using React Query with actor dependency management.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Comprehensive collection of React Query hooks for bike listings (CRUD operations), messages, founder profiles, user roles, website content, and analytics data.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "Custom mutation hook that saves the current user's profile and invalidates the user profile query cache on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm marketplace color palette (teal primary, orange accent) for both light and dark modes, plus utility classes for hero gradients and card hover effects.",
  "frontend/src/lib/utils.ts": "Utility functions including `cn` for merging Tailwind classes with clsx and a generic `debounce` function for delaying function execution.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AboutUs.tsx": "Displays founder profile information (Anuj Kumar) with contact details, social links, and website content fetched via useGetWebsiteContent hook.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with email/password form that authenticates using useAdminAuth hook and redirects to admin panel on success.",
  "frontend/src/pages/AdminPanel.tsx": "Protected admin dashboard with tabs for managing dashboard, users, content editor, listings moderation, and settings; wrapped in AdminRoute guard.",
  "frontend/src/pages/BikeDetail.tsx": "Displays detailed bike listing information with authentication and buyer profile completion checks before allowing access to listing details.",
  "frontend/src/pages/BikeListings.tsx": "Shows filterable and searchable grid of available bike listings with authentication and buyer profile completion requirements; includes search bar and filter controls.",
  "frontend/src/pages/FounderLogin.tsx": "Founder login page with two-step authentication: first validates hardcoded email/password credentials, then authenticates via Internet Identity and initializes founder status in the backend.",
  "frontend/src/pages/Home.tsx": "Home page displaying hero section, login options (Admin/Founder/User), registration sections for buyers/sellers, and available bike listings with conditional visibility based on authentication and profile completion status.",
  "frontend/src/pages/Messages.tsx": "Messages page for viewing and sending messages related to a specific bike listing, displaying listing details alongside the message thread with send functionality.",
  "frontend/src/pages/MyListings.tsx": "Displays authenticated user's bike listings with options to delete, toggle availability (mark as sold/available), view details, and share seller profile via social media.",
  "frontend/src/pages/SellBike.tsx": "Form page for authenticated users to create new bike listings with fields for title, brand, model, year, price, mileage, condition, description, and contact info.",
  "frontend/src/utils/shareHelpers.ts": "Utility functions for generating platform-specific share URLs (WhatsApp, Facebook, Twitter, Telegram) for both bike listings and user profiles, plus clipboard copy functionality.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended animations, typography plugin, and custom design tokens for a component library.",
  "project_state.json": "Project state tracking admin login system with email-password authentication (default account: marpallirohit@gmail.com) and About Us page featuring founder Anuj Kumar's contact details."
}