{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Admin Email-Password Authentication and Update About Us Page",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Update admin login page to validate credentials against backend email-password authentication system",
      "acceptanceCriteria": [
        "Admin login form accepts email and password inputs",
        "Form submits credentials to backend for validation",
        "Successful login redirects to admin panel",
        "Failed login displays appropriate error message"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminLogin.tsx",
          "operation": "modify",
          "description": "Replace the existing Internet Identity authentication flow with a traditional email-password form. Update the component to use the backend adminLogin method for credential validation. On successful authentication, store the admin session using the existing useAdminAuth hook pattern and redirect to /admin-panel. Display validation errors for incorrect credentials. Remove Internet Identity references from this component since it's admin-specific."
        },
        {
          "path": "frontend/src/hooks/useAdminAuth.ts",
          "operation": "modify",
          "description": "Update the admin authentication hook to support email-password authentication instead of relying solely on Internet Identity. Modify the login function to accept email and password parameters and call the backend adminLogin method. Maintain the existing session storage pattern with 24-hour expiration. Ensure the authentication state correctly reflects email-password based admin sessions."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update About Us page to display founder details: Anuj Kumar, contact 7828226397, WhatsApp 7828226397, location Bijapur Chhattisgarh 494444",
      "acceptanceCriteria": [
        "About Us page displays founder name as 'Anuj Kumar'",
        "Contact number 7828226397 is displayed and clickable",
        "WhatsApp number 7828226397 is displayed with WhatsApp link",
        "Location 'Bijapur Chhattisgarh 494444' is displayed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AboutUs.tsx",
          "operation": "modify",
          "description": "Update the founder profile display section to show the exact details: name 'Anuj Kumar', contact number '7828226397' (as a clickable tel: link), WhatsApp number '7828226397' (as a WhatsApp link using wa.me format), and location 'Bijapur Chhattisgarh 494444'. Use the existing getFounderProfile query to fetch this data from the backend. Ensure the layout clearly presents all four pieces of information with appropriate icons and formatting. Maintain the existing loading skeleton pattern while data is being fetched."
        }
      ]
    }
  ]
}